#第3章 2つの変数の記述統計

#3.2 散布図
test1 <- c(6,10,6,10,5,3,5,9,3,3,11,6,11,9,7,5,8,7,7,9)
test1
test2 <- c(10,13,8,15,8,6,9,10,7,3,18,14,18,11,12,5,7,12,7,7)
test2
plot(test1,test2)

sintest <- c(13,14,7,12,10,6,8,15,4,14,9,6,10,12,5,12,8,8,12,15)
plot(sintest,test1)
plot(sintest,test2)

#3.3 共分散
cov(test1,test2)
cov(test1,test2)*(length(test1)-1)/length(test1)

#3.4 相関係数
cor(test1,test2)

#3.5 クロス集計表
sugaku <- c("嫌い","嫌い","好き","好き","嫌い","嫌い","嫌い","嫌い","嫌い","好き","好き","嫌い","好き","嫌い","嫌い","好き","嫌い","嫌い","嫌い","嫌い")
sugaku
table(sugaku)
toukei <- c("好き","好き","好き","好き","嫌い","嫌い","嫌い","嫌い","嫌い","嫌い","好き","好き","好き","嫌い","好き","嫌い","嫌い","嫌い","嫌い","嫌い")
toukei
table(toukei)
table(sugaku,toukei)

#3.6 ファイ係数
sugaku01 <- ifelse(sugaku=="好き",1,0)
sugaku01
toukei01 <- ifelse(toukei=="好き",1,0)
toukei01
cor(sugaku01,toukei01)

#練習問題
#(1)
time <- c(1,3,10,12,6,3,8,4,1,5)
ten <- c(20,40,100,80,50,50,70,50,10,60)
plot(time,ten)

#(2)
cor(time,ten)

#(3)
youwa <- c("洋食","和食","和食","洋食","和食","洋食","洋食","和食","洋食","洋食","和食","洋食","和食","洋食","和食","和食","洋食","洋食","和食","和食")
amakara <- c("甘党","辛党","甘党","甘党","辛党","辛党","辛党","辛党","甘党","甘党","甘党","甘党","辛党","辛党","甘党","辛党","辛党","甘党","辛党","辛党")
table(youwa,amakara)

#(4)
youwa01 <- ifelse(youwa=="洋食",1,0)
amakara01 <- ifelse(amakara=="甘党",1,0)
cor(youwa01,amakara01)

